cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'puma/puma'

brew 'ack'
brew 'base64'
brew 'boot2docker'
brew 'cheat'
brew 'closure-linter'
brew 'coreutils'
brew 'dateutils'
brew 'ffind'
brew 'git-extras'
brew 'git-flow'
brew 'go'
brew 'grc'
brew 'grep'
brew 'hub'
brew 'hubflow'
brew 'imagemagick'
brew 'jp2a'
brew 'jsmin'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'ntfs-3g'
brew 'openssl'
brew 'osxutils'
brew 'parallel'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'rename'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'ngrok'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
